<?php
// +----------------------------------------------------------------------
// |
// | Consumer.php
// |
// +----------------------------------------------------------------------
// | Copyright (c) https://www.56br.com/ All rights reserved.
// +----------------------------------------------------------------------
// | Author:  wll <wanglelecc@gmail.com>
// +----------------------------------------------------------------------
// | Date: 2020-01-31 14:34
// +----------------------------------------------------------------------

namespace App\Consumer;

/**
 * 进程消费基类
 *
 * @package App\Consumer
 *
 * @Author wll
 * @Time 2020-01-31 14:55
 */
abstract class Consumer
{

    /**
     * 构造方法
     *
     * Consumer constructor.
     */
	public function __construct()
	{

	}


}